In [1]:
import numpy as np
import pandas as pd

## count the number of data

In [3]:
s = pd.Series(range(10))
s[3] = np.nan
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [5]:
s.count()

9

In [9]:
df = pd.DataFrame(np.arange(16).reshape(4,4), dtype=float)
df.iloc[2,3] = np.nan
df

      0     1     2     3
0   0.0   1.0   2.0   3.0
1   4.0   5.0   6.0   7.0
2   8.0   9.0  10.0   NaN
3  12.0  13.0  14.0  15.0

In [10]:
df.count()

0    4
1    4
2    4
3    3
dtype: int64

In [11]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head()

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

In [12]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [13]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

In [14]:
titanic.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

## count category val

In [15]:
titanic.sex.value_counts()

male      577
female    314
Name: sex, dtype: int64

In [16]:
titanic.embark_town.value_counts()

Southampton    644
Cherbourg      168
Queenstown      77
Name: embark_town, dtype: int64

## Sorting

In [17]:
np.random.seed(2021)
s2 = pd.Series(np.random.randint(10, size=100))
s2.tail()

95    9
96    6
97    9
98    3
99    9
dtype: int64

In [18]:
s2.value_counts()

9    15
6    13
5    12
7    11
3    11
1    10
4     9
2     9
0     7
8     3
dtype: int64

In [19]:
s2.value_counts().sort_values()

8     3
0     7
4     9
2     9
1    10
7    11
3    11
5    12
6    13
9    15
dtype: int64

In [21]:
# dec 
s2.value_counts().sort_values(ascending=False)

9    15
6    13
5    12
3    11
7    11
1    10
2     9
4     9
0     7
8     3
dtype: int64

In [22]:
titanic.sort_values(by='fare', ascending=False).head()

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
258         1       1  female  35.0  ...   NaN    Cherbourg    yes   True
737         1       1    male  35.0  ...     B    Cherbourg    yes   True
679         1       1    male  36.0  ...     B    Cherbourg    yes  False
88          1       1  female  23.0  ...     C  Southampton    yes  False
27          0       1    male  19.0  ...     C  Southampton     no  False

[5 rows x 15 columns]

In [24]:
titanic.sort_values(by=['fare', 'age']).head()

     survived  pclass   sex   age  ...  deck  embark_town  alive alone
302         0       3  male  19.0  ...   NaN  Southampton     no  True
271         1       3  male  25.0  ...   NaN  Southampton    yes  True
179         0       3  male  36.0  ...   NaN  Southampton     no  True
822         0       1  male  38.0  ...   NaN  Southampton     no  True
806         0       1  male  39.0  ...     A  Southampton     no  True

[5 rows x 15 columns]

In [25]:
titanic['sex'].value_counts()

male      577
female    314
Name: sex, dtype: int64

## row / col sum

In [28]:
np.random.seed(2021)
df2 = pd.DataFrame(np.random.randint(10, size=(4,8)))
df2

   0  1  2  3  4  5  6  7
0  4  5  9  0  6  5  8  6
1  6  6  6  1  5  7  1  1
2  5  2  0  3  1  0  2  6
3  4  8  5  1  6  7  5  6

In [29]:
df2.sum()

0    19
1    21
2    20
3     5
4    18
5    19
6    16
7    19
dtype: int64

In [30]:
df2.sum(axis=1)

0    43
1    33
2    19
3    42
dtype: int64

In [31]:
df2['RowSum'] = df2.sum(axis=1)
df2

   0  1  2  3  4  5  6  7  RowSum
0  4  5  9  0  6  5  8  6      43
1  6  6  6  1  5  7  1  1      33
2  5  2  0  3  1  0  2  6      19
3  4  8  5  1  6  7  5  6      42

In [32]:
df2.loc['ColSum', :] = df2.sum()
df2

           0     1     2    3     4     5     6     7  RowSum
0        4.0   5.0   9.0  0.0   6.0   5.0   8.0   6.0    43.0
1        6.0   6.0   6.0  1.0   5.0   7.0   1.0   1.0    33.0
2        5.0   2.0   0.0  3.0   1.0   0.0   2.0   6.0    19.0
3        4.0   8.0   5.0  1.0   6.0   7.0   5.0   6.0    42.0
ColSum  19.0  21.0  20.0  5.0  18.0  19.0  16.0  19.0   137.0

## quiz 4.4.3

In [37]:
# 승객의 평균 나이
np.round(titanic.age.mean(), 1)

29.7

In [38]:
# 여성 승객의 평균 나이
titanic[titanic.sex == 'female'].head()

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
8         1       3  female  27.0  ...   NaN  Southampton    yes  False
9         1       2  female  14.0  ...   NaN    Cherbourg    yes  False

[5 rows x 15 columns]

In [40]:
titanic# 여성 승객의 평균 나이
np.round(titanic[titanic.sex == 'female'].age.mean(), 1)

27.9

In [41]:
# 3. 1등실, 여성 승객의 평균 나이
titanic[titanic.pclass == 1 & titanic.sex == 'female'].age.mean()

TypeError: ignored

In [44]:
# 3. 1등실, 여성 승객의 평균 나이
np.round(titanic[titanic.pclass == 1][titanic.sex == 'female'].age.mean(), 2)

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: UserWarning: Boolean Series key will be reindexed to match DataFrame index.

34.61

In [45]:
import warnings
warnings.filterwarnings('ignore')

In [46]:
# 3. 1등실, 여성 승객의 평균 나이
np.round(titanic[titanic.pclass == 1][titanic.sex == 'female'].age.mean(), 2)

34.61

## apply 변환

In [51]:
df3 = pd.DataFrame({
    'A' : [1,3,4,3,4],
    'B' : [2,3,1,2,3],
    'C' : [1,5,2,4,4]
})
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [50]:
df3.apply(lambda x : x.max() - x.min())

A    3
B    2
C    4
dtype: int64

In [52]:
df3.apply(lambda x : x.max() - x.min(), axis=1)

0    1
1    2
2    3
3    2
4    1
dtype: int64

In [55]:
titanic['성년'] = titanic.apply(lambda x : '성년' if x.age >= 20 else '미성년', axis=1)
titanic.tail()

     survived  pclass     sex   age  sibsp  ...  deck  embark_town alive  alone   성년
886         0       2    male  27.0      0  ...   NaN  Southampton    no   True   성년
887         1       1  female  19.0      0  ...     B  Southampton   yes   True  미성년
888         0       3  female   NaN      1  ...   NaN  Southampton    no  False  미성년
889         1       1    male  26.0      0  ...     C    Cherbourg   yes   True   성년
890         0       3    male  32.0      0  ...   NaN   Queenstown    no   True   성년

[5 rows x 16 columns]

## quiz 4.4.4

In [56]:
titanic['category1'] = titanic.apply(lambda x : x.sex if x.age > 20  else 'child', axis=1)
titanic.tail()

     survived  pclass     sex   age  ...  alive  alone   성년 category1
886         0       2    male  27.0  ...     no   True   성년      male
887         1       1  female  19.0  ...    yes   True  미성년     child
888         0       3  female   NaN  ...     no  False  미성년     child
889         1       1    male  26.0  ...    yes   True   성년      male
890         0       3    male  32.0  ...     no   True   성년      male

[5 rows x 17 columns]

## fillna method

In [60]:
df

      0     1     2     3
0   0.0   1.0   2.0   3.0
1   4.0   5.0   6.0   7.0
2   8.0   9.0  10.0   NaN
3  12.0  13.0  14.0  15.0

In [62]:
df.apply(pd.value_counts)

        0    1    2    3
0.0   1.0  NaN  NaN  NaN
1.0   NaN  1.0  NaN  NaN
2.0   NaN  NaN  1.0  NaN
3.0   NaN  NaN  NaN  1.0
4.0   1.0  NaN  NaN  NaN
5.0   NaN  1.0  NaN  NaN
6.0   NaN  NaN  1.0  NaN
7.0   NaN  NaN  NaN  1.0
8.0   1.0  NaN  NaN  NaN
9.0   NaN  1.0  NaN  NaN
10.0  NaN  NaN  1.0  NaN
12.0  1.0  NaN  NaN  NaN
13.0  NaN  1.0  NaN  NaN
14.0  NaN  NaN  1.0  NaN
15.0  NaN  NaN  NaN  1.0

In [63]:
df.apply(pd.value_counts).fillna(0.0)

        0    1    2    3
0.0   1.0  0.0  0.0  0.0
1.0   0.0  1.0  0.0  0.0
2.0   0.0  0.0  1.0  0.0
3.0   0.0  0.0  0.0  1.0
4.0   1.0  0.0  0.0  0.0
5.0   0.0  1.0  0.0  0.0
6.0   0.0  0.0  1.0  0.0
7.0   0.0  0.0  0.0  1.0
8.0   1.0  0.0  0.0  0.0
9.0   0.0  1.0  0.0  0.0
10.0  0.0  0.0  1.0  0.0
12.0  1.0  0.0  0.0  0.0
13.0  0.0  1.0  0.0  0.0
14.0  0.0  0.0  1.0  0.0
15.0  0.0  0.0  0.0  1.0

## quiz 4.4.5

In [64]:
titanic.age.fillna(titanic.age.mean(), inplace=True)
titanic.tail()

     survived  pclass     sex        age  ...  alive  alone   성년 category1
886         0       2    male  27.000000  ...     no   True   성년      male
887         1       1  female  19.000000  ...    yes   True  미성년     child
888         0       3  female  29.699118  ...     no  False  미성년     child
889         1       1    male  26.000000  ...    yes   True   성년      male
890         0       3    male  32.000000  ...     no   True   성년      male

[5 rows x 17 columns]

## astype() method

In [65]:
df.apply(pd.value_counts).fillna(0.0).astype(int)

      0  1  2  3
0.0   1  0  0  0
1.0   0  1  0  0
2.0   0  0  1  0
3.0   0  0  0  1
4.0   1  0  0  0
5.0   0  1  0  0
6.0   0  0  1  0
7.0   0  0  0  1
8.0   1  0  0  0
9.0   0  1  0  0
10.0  0  0  1  0
12.0  1  0  0  0
13.0  0  1  0  0
14.0  0  0  1  0
15.0  0  0  0  1

## Change float to category

In [66]:
ages = [0, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 101]

In [67]:
bins = [1, 20, 30, 50, 70, 100]
labels = ['미성년자', '청년', '중년', '장년', '노년']
cats = pd.cut(ages, bins, labels=labels)
cats

[NaN, '미성년자', '미성년자', '청년', '청년', ..., '장년', '미성년자', '중년', '중년', NaN]
Length: 12
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [68]:
cats.codes

array([-1,  0,  0,  1,  1,  2,  2,  3,  0,  2,  2, -1], dtype=int8)

In [70]:
np.random.seed(2021)
data = np.random.randn(1000)
cats = pd.qcut(data, 4, labels=['Q1', 'Q2', 'Q3', 'Q4'])
cats

['Q4', 'Q3', 'Q2', 'Q1', 'Q3', ..., 'Q3', 'Q1', 'Q4', 'Q2', 'Q2']
Length: 1000
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [71]:
pd.value_counts(cats)

Q4    250
Q3    250
Q2    250
Q1    250
dtype: int64